FO/apps/ITAFRONTOFFICE/lib/itaPHPJiride/testREquest.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1886="http://tempuri.org">
    <SOAP-ENV:Header>
        <wsse:Security SOAP-ENV:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>UM_H876\SUAPinterop</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">interop951</wsse:Password>
                <wsse:Nonce>GQJJgwk=</wsse:Nonce>
                <wsu:Created>2016-12-02T11:28:09.123Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ProtocollazioneEntrata xmlns="http://paleo.regione.marche.it/services/">
            <richiesta>
                <Classificazioni>
                    <Classificazione>
                        <CodiceFascicolo></CodiceFascicolo>
                        <NuovoFascicolo>
                            <CodiceClassifica>9.5</CodiceClassifica>
                            <Custode>
                                <CodiceUO>A2_S2</CodiceUO>
                                <Cognome>SUAP</Cognome>
                                <Nome>interop</Nome>
                                <Ruolo>IMPIEGATO PROTOCOLLISTA</Ruolo>
                            </Custode>
                            <Descrizione>Protocollazione Richiesta on-line 001321/2016 - Procedimento generico</Descrizione>
                        </NuovoFascicolo>
                    </Classificazione>
                </Classificazioni>
                <DocumentoPrincipale>
                    <Nome></Nome>
                    <Stream></Stream>
                </DocumentoPrincipale>
                <DocumentoPrincipaleAcquisitoIntegralmente>false</DocumentoPrincipaleAcquisitoIntegralmente>
                <Oggetto>Protocollazione Richiesta on-line 001321/2016 - Procedimento generico</Oggetto>
                <Operatore>
                    <CodiceUO>A2_S2</CodiceUO>
                    <Cognome>SUAP</Cognome>
                    <Nome>interop</Nome>
                    <Ruolo>IMPIEGATO PROTOCOLLISTA</Ruolo>
                </Operatore>
                <Privato>false</Privato>
                <CodiceRegistro>REGUMH876</CodiceRegistro>
                <DataArrivo>2016-12-02</DataArrivo>
                <Mittente>
                    <CodiceRubrica></CodiceRubrica>
                    <CorrispondenteOccasionale>
                        <MessaggioRisultato>
                            <Descrizione></Descrizione>
                            <TipoRisultato>Info</TipoRisultato>
                        </MessaggioRisultato>
                        <Cognome>CONCETTONI</Cognome>
                        <Email>marcello.concettoni@ingpec.eu</Email>
                        <Nome>MARCELLO</Nome>
                        <Tipo>Persona</Tipo>
                    </CorrispondenteOccasionale>
                </Mittente>
            </richiesta>
        </ProtocollazioneEntrata>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>




